
#!/bin/bash

# Назва вашого виконуваного файлу (як вказано в CMakeLists.txt)
APP_NAME="Lab4App"

# Перевіряємо, чи існує файл після компіляції
if [ -f "./build/$APP_NAME" ]; then
    echo "Запуск програми $APP_NAME..."
    
    # Запускаємо програму з папки build
    # Якщо моделі лежать у корені, програма їх знайде, 
    # якщо в коді прописані правильні шляхи.
    ./build/$APP_NAME
else
    echo "Помилка: Виконуваний файл не знайдено в папці build."
    echo "Спробуйте спочатку запустити ./build.sh"
    exit 1
fi
